/* XCAP */
"FederationProviderPasscodeScreenTitle" = "Yhdistämisen tarjoajan pääsykoodi";

/* XMSG */
"FederationProviderPasscodeScreenContent" = "Yhdistämisen tarjoaja tarvitsee syöttöäsi varmenteen lataamista/tallennusta varten.";

/* XBUT */
"FederationProviderPasscodeScreenOkButtonText" = "Valmis";

/* XBUT */
"FederationProviderPasscodeScreenCancelButtonText" = "Peruuta";

/* XCAP */
"FederationProviderCertificateConfirmationScreenTitle" = "Yhdistämisen varmenne";

/* XMSG */
"FederationProviderCertificateConfirmationScreenMessage" = "Yhdistämiseen tallennettu identiteetti on jo olemassa. Paina painiketta \"OK\", jos haluat käyttää sitä, tai \"Peruuta\" uuden identiteetin hankkimista varten.";

/* XBUT */
"FederationProviderCertificateConfirmationScreenCancelButtonText" = "Peruuta";

/* XBUT */
"FederationProviderCertificateConfirmationScreenOkButtonText" = "OK";

